# SetSurfaceTransparency Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetSurfaceTransparency Method
OverrideGraphicSettings Class See Also
---
Sets the projection surface transparency.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public OverrideGraphicSettings SetSurfaceTransparency(
	int transparency
)
```

Visual Basic
---
```text
Public Function SetSurfaceTransparency ( _
	transparency As Integer _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetSurfaceTransparency(
	int transparency
)
```

# ### Parameters
transparency
    Type: System..::..Int32 Value of the transparency of the projection surface (0 = opaque, 100 = fully transparent).
# ### Return Value
Reference to the changed object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Transparency must be greater than 0 and less than 100. |

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace